#include <stdio.h>

int main(){
    int *a; // 그러니까 얘는 주소 한개를 저장하는 변수 그러니까 a=주소고
    *a = 3; // 이렇게 하면 a안에있는 주소에 있는 수를 3으로 하는거 

    int b = 3; // 같은거임 그러니까 주소 != 안에 있는 값

    // 너네집에 원우있으면 집이랑 원우랑 같은거 아니잖아

    // 그러니까 만약 int *a 이렇게 선언을 했으면
    // a가 집주소고 *a가 사람

    // int a를 했으면
    // a가 사람이고 &a가 집주소 ㅇㅇ *a는 a에다가 주소를 저장한다는 뜻 ㅇㅇ &a는 이미 있는 변수에 대한 주소고
    // *a는 선언할때 부터 주소를 쓴다는거임

    // 포인터변수 주소를 저장하는 변수

    int* a;
    a 주소
    int b = *a; s[0];
    // 1 2 3 4 5.1 5.2 6 7 8 9 10 < 메모리임
    // 만약 int a;를 하면 얘가 메모리중 아무곳에 얘를 저장함
    // 만약 4번에 a가 저장이 됐으면, print(a); 를 하면 a가 나오고 print(&a)를 하면 4가 나오는거
    // 만약 int *a를 하면 a에 4(메모리주소)가 저장이 되는거임 선언할때 *a는 그냥 주소를 저장하는 공간을 만드는거고 사용항때 *은 그 주소 안에 뭐가 있는지 보는거
    // 그러고나서 *a(4의 내용물) = 3을 하면 4번 메모리에 3이 저장이 되는거고

    char *s;

    printf("%d\n", *a); // a안에 있는 값을 출력
    printf("%p", a); // a의 주소값을 출력 포인터 형식인자
}